[
  {
    "deadline": "04-May-25",
    "title": "Africa: Small Grants Programme for Palliative Care Development 2025",
    "applicationUrl": "https://africasmallgrants.truecolourstrust.org.uk/how-to-apply-open/",
    "organization": "Organization Not Found",
    "description": "The True Colours Trust Small Grants Programme for Palliative Care Development in Africa call for applications is now open. Priority Areas Palliative care medicines: Medicines from the approved IAHPC and WHO lists of palliative care medicines will be considered. Equipment for palliative care: Equipment from the WHO approved list of palliative care equipment will be considered. Transport for the delivery of palliative care services (fuel, bicycles etc.) Data or mobile technology for the remote del...",
    "amount": 500000,
    "currency": "$",
    "status": "active",
    "eligibility": "The programme is open to registered hospices and palliative care providers based and managed in Africa Any organisation which is currently in receipt of funding from The True Colours Trust, is not eligible for funding, even if that funding is not from the Africa Small Grants Programme.",
    "category": "General"
  },
  {
    "deadline": "30-Apr-25",
    "title": "Nominations open for Champions of the Earth Award",
    "applicationUrl": "https://www.unep.org/championsofearth/how-we-find-our-champions",
    "organization": "Organization Not Found",
    "description": "The United Nations Environment Programme is thrilled to invite nominations for its Champions of the Earth Award to honour individuals and organizations whose actions have a transformative impact on the environment. The award spotlights outstanding climate action focusing on solutions on methane, buildings and construction, sustainable cooling including energy efficiency, clean air, and forests. Award Categories Policy Leadership Award: This award category recognizes individuals or organizations...",
    "amount": null,
    "currency": null,
    "status": "active",
    "eligibility": "See official guidelines",
    "category": "General"
  },
  {
    "deadline": "12-May-25",
    "title": "Nominations open for TIAW World of Difference Award",
    "applicationUrl": "https://tiaw.org/awards/",
    "organization": "Organization Not Found",
    "description": "The International Alliance for Women World of Difference Award recognizes extraordinary women, and men, whose efforts have advanced the economic empowerment of women locally, regionally or globally. Whether the candidate is working on a small scale in the developing world or making an impact at the top of the world’s largest corporations, whether your candidate is well known or an unsung heroine or hero, they want you to tell them the stories of the people whose extraordinary achievements are fu...",
    "amount": null,
    "currency": null,
    "status": "active",
    "eligibility": "See official guidelines",
    "category": "General"
  },
  {
    "deadline": "02-May-25",
    "title": "Call for Nominations: Tyler Prize for Environmental Achievement",
    "applicationUrl": "https://www.tylerprize.org/nominations",
    "organization": "Organization Not Found",
    "description": "The Tyler Prize for Environmental Achievement (the Tyler Prize) is the world’s longest running and most prestigious annual environmental award. The Prize is awarded annually to scientists, ecologists, economists, policymakers, or organizations that have delivered environmental solutions with measurable global impact. Prize Information Recipients of the Tyler Prize are honored in a ceremony in which they are presented with the Tyler Prize medallion, plaque, and an award of USD $250,000. Eligibili...",
    "amount": 250000,
    "currency": "$",
    "status": "active",
    "eligibility": "The Tyler Prize is awarded to individuals and institutions from any part of the world working to deliver global impact for the environment All nominations must come from a third party (self-nominations are not permitted) Multiple nominations from a single nominator and posthumous nominations are not...",
    "category": "General"
  },
  {
    "deadline": "30-Apr-25",
    "title": "Applications open for Environmental Grants Program 2025",
    "applicationUrl": "https://whitefeatherfoundation.com/news/applications-now-open-for-2025-environmental-projects/",
    "organization": "Organization Not Found",
    "description": "Applications are now open for the Environmental Grants Program. Funding Information The grants are available in $5,000 – $15,000 range, dependent upon capacity at the time of the campaign. They do not accept requests greater than $15,000 at this time. Eligibility Criteria The scholarship is open to all countries worldwide. Your group must be a registered charity, educational institution or business entity to be eligible. They cannot award individuals with funding. For more information, visit The...",
    "amount": 15000,
    "currency": "$",
    "status": "active",
    "eligibility": "The scholarship is open to all countries worldwide. Your group must be a registered charity, educational institution or business entity to be eligible. They cannot award individuals with funding. For more information, visit The White Feather Foundation .",
    "category": "General"
  },
  {
    "deadline": "12-May-25",
    "title": "Call for Nominations: 2.0 Spotlight Initiative Africa Regional Programme (SIARP)",
    "applicationUrl": "https://africa.unwomen.org/en/programme-implementation/2025/04/call-for-nominations-for-the-establishment-of-the-spotlight-initiative-africa-regional-programme-siarp-20-civil-society-regional-reference-group-csrrg",
    "organization": "Organization Not Found",
    "description": "The second phase of the Spotlight Initiative Africa Regional Programme (SIARP 2.0), led by the UN Development Cooperation Office for Africa, in partnership with the African Union Commission, aims to improve engagement between civil society, AUC, RECs and UN, ensuring more systematic participation of civil society organizations (CSOs) in decision-making processes, which will enhance the Initiative’s deeper accountability to women’s social movements, youth networks and feminist civil society. UN W...",
    "amount": null,
    "currency": null,
    "status": "active",
    "eligibility": "See official guidelines",
    "category": "General"
  },
  {
    "deadline": "06-May-25",
    "title": "CFPs: Promoting Financial Integrity, Economic Justice and Domestic Resource Mobilization",
    "applicationUrl": "https://grants.mfa.no/#call/4083/details",
    "organization": "Organization Not Found",
    "description": "The Norad – The Norwegian Agency for Development Cooperation is seeking proposals from non-governmental organizations to advance advocacy, public discourse and solutions that promote financial integrity, economic justice and domestic resource mobilization. Objectives Objective 1 Civil society in developing countries: Civil society in developing countries advances public discourse and solutions for improved domestic resource mobilization, economic justice, transparency and financial integrity. Ob...",
    "amount": null,
    "currency": null,
    "status": "active",
    "eligibility": "Organisation and administration: The applicant must be an independent legal person. Accurate and complete information about the nature of the organisation must be provided. The applicant must have its own statutes/articles of association and an independent board of directors.",
    "category": "General"
  },
  {
    "deadline": "03-Jun-25",
    "title": "Registrations open for iF Social Impact Prize (Round One)",
    "applicationUrl": "https://ifdesign.com/en/if-social-impact-prize",
    "organization": "Organization Not Found",
    "description": "The International Forum Design (iF Design) is inviting applications for its iF Social Impact Prize to support projects that contribute to their society. Categories Sustainable Development Goals of the UNITED NATIONS (Goal 1-15): No poverty Zero hunger Goodhealth and well-being Quality education Gender equality Clean water and sanitation Affordable and clean energy Decent work and economic growth Industry, innovation and infrastructure Reduced inequalities Sustainable cities and communities Respo...",
    "amount": 15000,
    "currency": null,
    "status": "active",
    "eligibility": "Companies, design studios, NGOs, foundations, public and other organizations, social enterprises and entrepreneurs are welcome to submit. Ineligibility Criteria Student concepts cannot be accepted. For more information, visit iF Design .",
    "category": "General"
  },
  {
    "deadline": "01-May-25",
    "title": "Enter the Middle East & Africa Cleaning, Sanitation & Hygiene Awards 2025",
    "applicationUrl": "https://www.elevatehygieneawards.org/",
    "organization": "Organization Not Found",
    "description": "Applications are open for the Elevate Bridge Builders UK Middle East & Africa Cleaning, Sanitation & Hygiene Awards 2025. These awards shine a highlight on the unbelievable people, companies, and organizations making an actual-life difference within the hygiene, cleansing, and sanitation sectors throughout the area. From groundbreaking innovations to impactful public health initiatives, this is an opportunity to recognize unsung heroes who maintain communities clear, wholesome, and secure. Award...",
    "amount": null,
    "currency": null,
    "status": "active",
    "eligibility": "Whether you’re a business, nonprofit, a government initiative, or an individual championing hygiene and sanitation, there’s category for you. Applicants in all countries can apply. For more information, visit Elevate Bridge Builders UK Ltd .",
    "category": "General"
  },
  {
    "deadline": "10-May-25",
    "title": "Apply for P&G Alumni Foundation Grant Program 2025",
    "applicationUrl": "https://pgalumnifoundation.org/grant-process/",
    "organization": "Organization Not Found",
    "description": "In the 20th year of grant-making, the P&G Alumni Foundation encourage a charitable organization to apply for its grant program if their mission aligns with the Foundation’s focus on economic empowerment and a P&G Alum is actively and meaningfully involved. The Foundation invests in programming across the globe that contributes toward real employment, financial independence, and the economic well-being of those served. Areas The core areas supported are Job development & vocational training. Busi...",
    "amount": null,
    "currency": null,
    "status": "active",
    "eligibility": "The Foundation accepts grant requests from tax-exempt 501(c)(3) organizations in the U.S. and from charitable equivalents outside the U.S. subject to the following eligibility requirements: Your mission and the project or program seeking funding must be strongly aligned with the Foundation’s mission...",
    "category": "General"
  },
  {
    "deadline": "27-Jun-25",
    "title": "CFAs: AREF Research Development Fellowship Programme (Africa)",
    "applicationUrl": "https://africaresearchexcellencefund.org.uk/funding-calls/research-development-fellowship-2025-26/",
    "organization": "Organization Not Found",
    "description": "The Africa Research Excellence Fund is pleased to announce its call for the AREF Research Development Fellowship Programme to support researchers in Africa who are emerging leaders and working on important challenges for human health, to develop their skills as a researcher. The aim of the Research Development Fellowship Programme is to provide opportunities for talented health researchers based in Africa, so that they can lead research that is responsive to its African settings and can contribu...",
    "amount": 50000,
    "currency": "£",
    "status": "active",
    "eligibility": "The RDF scheme focuses on Early-Career Health Researchers (ECR) from Africa who plan to develop their research career in Africa and have the potential to become research leaders.",
    "category": "General"
  },
  {
    "deadline": "30-Jun-25",
    "title": "Submissions open for Al-Sumait Prize in Food Security 2025",
    "applicationUrl": "https://www.alsumaitprize.org/nominations/",
    "organization": "Organization Not Found",
    "description": "The Al-Sumait Prize honors individuals or institutions who have, through their work or research, made significant advances in the fields of food security, health, and education in Africa. Sponsored by the Kuwait Ministry of Foreign Affairs on behalf of the State of Kuwait and managed by the Kuwait Foundation for the Advancement of Science (KFAS), The goal is to shine a light on those making a positive difference to sustainable development in Africa. Objectives Administered by KFAS and a Board of...",
    "amount": 1000000,
    "currency": "$",
    "status": "active",
    "eligibility": "See official guidelines",
    "category": "General"
  },
  {
    "deadline": "31-May-25",
    "title": "Nominations open for ESD Okayama Award 2025",
    "applicationUrl": "https://www.city.okayama.jp/kurashi/0000070653.html",
    "organization": "Organization Not Found",
    "description": "The Okayama City is now accepting nominations for the ESD Okayama Award, which recognizes outstanding ESD (Education for Sustainable Development) initiatives anywhere in the world. The ESD Okayama Award has been held since 2015 under the joint sponsorship of Okayama City and the ESD Okayama Award Steering Board, with the aim of honoring excellent examples of ESD around the world, thereby supporting the activities of the award-winning project organizations and contributing to the spread of ESD ac...",
    "amount": 3000,
    "currency": "$",
    "status": "active",
    "eligibility": "ESD projects that have been implemented for more than 2 years by organizations anywhere in the world. Projects must have a track record of activities and outcomes. Projects in the planning stages are not eligible. Only one application per organization can be accepted.",
    "category": "General"
  },
  {
    "deadline": "10-Apr-25",
    "title": "RFPs: Ford Foundation JustFilms Grants Program",
    "applicationUrl": "https://www.fordfoundation.org/work/our-grants/justfilms/justfilms-application/",
    "organization": "Organization Not Found",
    "description": "Applications are now open for the Ford Foundation JustFilms Grants Program to support artist-driven, feature-length documentary films that creatively intersect with the social justice issues that are central to the Ford Foundation’s mission. All projects submitted for JustFilms grants will be assessed on the basis of alignment with Ford Foundation priorities, intersectional representation, innovation in storytelling, and production viability & independence, as well as social and cultural impact....",
    "amount": 30000,
    "currency": null,
    "status": "active",
    "eligibility": "JustFilms accepts submissions for feature documentary films only (running time 50 minutes or more) from filmmakers globally, focusing on regions where the Ford Foundation has offices.",
    "category": "General"
  },
  {
    "deadline": "29-Apr-25",
    "title": "Earth Journalism Network’s Biodiversity Story Grants Program 2025",
    "applicationUrl": "https://earthjournalism.net/opportunities/biodiversity-story-grants-2025",
    "organization": "Organization Not Found",
    "description": "The Earth Journalism Network (EJN) is offering reporting grants to journalists to support the production of in-depth stories on biodiversity. To ensure that local audiences have access to trusted, timely and accurate information on the current critical state of biodiversity, EJN’s Biodiversity Media Initiative is offering 5-10 story grants to increase the quality and quantity of biodiversity coverage, and to highlight the overwhelming threats to the natural world as well as promising or proven s...",
    "amount": 10000,
    "currency": null,
    "status": "active",
    "eligibility": "For the purposes of this grant call, they are only accepting applications for stories focused on countries listed though journalists from any country can apply. They would like to hear from applicants based in countries in which they have not offered grants to previously.",
    "category": "General"
  },
  {
    "deadline": "30-Apr-25",
    "title": "RFPs: Small Grants Program to Strengthen Food Fortification Data",
    "applicationUrl": "https://micronutrientforum.org/request-for-proposals-dina-2025-small-grants-program/",
    "organization": "Organization Not Found",
    "description": "The Micronutrient Data Innovation Alliance (DInA) has launched its second Small Grants Program, inviting eligible organizations in low- and middle-income countries to apply for grants focused on large-scale food fortification (LSFF) data. While LSFF has a long track record of success, significant data gaps still hinder effective program design, implementation, and scale-up. Through this initiative, DInA aims to generate new evidence that strengthens LSFF programming, improves policy decision-mak...",
    "amount": 15000,
    "currency": "$",
    "status": "active",
    "eligibility": "To qualify, applicants must: Live and work in a low- and middle-income country (as classified by the World Bank) Be a member of DInA. Represent an organization or stakeholder group (e.g., government, academia, non-profit etc.) Commit to working on an LSFF policy-related topic.",
    "category": "General"
  },
  {
    "deadline": "01-Aug-25",
    "title": "Elephant Conservation & Research Funding Support Program 2025",
    "applicationUrl": "https://elephantconservation.org/initiatives/grant-programs/",
    "organization": "Organization Not Found",
    "description": "The International Elephant Foundation’s Elephant Conservation and Research Funding Support Program is now open for Application Submissions. IEF is interested in supporting effective, sustainable conservation projects that will make a positive impact for elephants, habitats and the communities that share their land. Funding Information The average Grant Award is $15,000 per year. Eligible Projects IEF prefers to support annual and multi-year projects that address: Human-Elephant Conflict preventi...",
    "amount": 15000,
    "currency": "$",
    "status": "active",
    "eligibility": "See official guidelines",
    "category": "General"
  },
  {
    "deadline": "30-Apr-25",
    "title": "Apply for Pulitzer Center ACE Micro Grants",
    "applicationUrl": "https://pulitzercenter.org/grants-fellowships/opportunities-journalists/ace-micro-grants-2025",
    "organization": "Organization Not Found",
    "description": "The Pulitzer Center is currently accepting applications for the Africa Climate and Environment Micro Grants, a call for outreach proposals for local movements in Africa to apply with innovative ideas for outreach activities that clearly and creatively integrate one or more Pulitzer Center stories, while targeting young professionals or communities on topics including the rainforest, ocean and marine protection, spaces, and the impacts of climate change on labor and workers. Through the micro gra...",
    "amount": 3000,
    "currency": "$",
    "status": "active",
    "eligibility": "Types of organizations: This micro grant is intended for grassroots organizations, civil society organizations and coalitions, youth movements, and other groups working on issues relating to the intersection of climate and labour, the environment, journalism, civil rights, and active citizenship in...",
    "category": "General"
  },
  {
    "deadline": "30-Apr-25",
    "title": "Apply for IBM Sustainability Accelerator",
    "applicationUrl": "https://www.ibm.com/campaign/2025/sustainability-accelerator-rfp",
    "organization": "Organization Not Found",
    "description": "IBM is accepting proposals for projects focused on sustainable consumption and production, driven by AI innovation. This new cohort will aim to create sustainable consumption and production solutions, supporting United Nations Sustainable Development Goals 9 or 12 to accelerate sustainable economic development, boost supply chain efficiency and expand AI deployment and capacity. The IBM Sustainability Accelerator is designed to support communities vulnerable to environmental challenges with a ne...",
    "amount": null,
    "currency": null,
    "status": "active",
    "eligibility": "The IBM Sustainability Accelerator is open to nonprofit and government organizations globally. For more information, visit IBM .",
    "category": "General"
  },
  {
    "deadline": "15-May-25",
    "title": "GFI Alternative Protein Research Grants",
    "applicationUrl": "https://gfi.org/researchgrants/",
    "organization": "Organization Not Found",
    "description": "The Good Food Institute (GFI) is requesting research proposals aimed at tackling urgent scientific and technological challenges within the alternative protein industry. The program is dedicated to achieving three primary objectives: addressing technical bottlenecks, catalyzing further funding, and fostering collaborations to attract new talent to the field. To meet these goals, they annually release requests for proposals (RFPs) inviting open-access research focused on enhancing organoleptic pro...",
    "amount": 3,
    "currency": "$",
    "status": "active",
    "eligibility": "Submissions are open to applicants from all sectors worldwide, encompassing academia, government, industry, and nonprofits. GFI strongly encourages women and gender minorities, racial and ethnic minorities, and other individuals under-represented in the alternative protein industry to apply for fund...",
    "category": "General"
  },
  {
    "deadline": "22-May-25",
    "title": "RFPs: Independent Medical Education Grants to optimize ER+ Metastatic Breast Cancer Treatment",
    "applicationUrl": "https://cdn.pfizer.com/pfizercom/2025-03/GMG-2025-ONG-G-OptimizingERMetastaticBreastCancerTreatment.pdf?VersionId=NpmTp7pPIeQ_o1F2P_3FSUvGdtt4fUuq",
    "organization": "Organization Not Found",
    "description": "Pfizer Inc. and Arvinas are collaborating to provide grant support for continuing professional education in metastatic Breast Cancer (mBC). Area of Interest This competitive grant program seeks to support independent medical education activities focused on the evolving treatment landscape for patients with ER+/HER2- mBC. Applicants are encouraged to identify and address the educational needs of healthcare professionals related to novel treatments in the evolving clinical landscape of ER+/HER2- m...",
    "amount": 175000,
    "currency": "$",
    "status": "active",
    "eligibility": "The following types of organizations may apply: medical, nursing, allied health, and/or pharmacy professional schools; healthcare institutions (both large and small); professional organizations/medical societies; medical education companies; and other entities with a mission related to healthcare pr...",
    "category": "General"
  },
  {
    "deadline": "26-May-25",
    "title": "ISTAT Foundation Grant Program to support Aviation Community",
    "applicationUrl": "https://foundation.istat.org/Programs/Grants",
    "organization": "Organization Not Found",
    "description": "ISTAT Foundation is offering grant funding to organizations around the globe that advance commercial aviation or engage in aviation-related humanitarian efforts. In 2025, they will be prioritizing educational projects and programs that support environmental sustainability within aviation to address the growing need for sustainable practices in the industry. Grant Types Educational Grant Educational Grants are intended to build and enhance awareness of diverse careers in aviation, inspiring the n...",
    "amount": null,
    "currency": null,
    "status": "active",
    "eligibility": "See official guidelines",
    "category": "General"
  },
  {
    "deadline": "14-Apr-25",
    "title": "Rise Up launches Leadership & Advocacy Training Program in Kenya",
    "applicationUrl": "https://riseuptogether.org/call-for-applications-rise-up-launches-leadership-advocacy-program-in-kenya/",
    "organization": "Organization Not Found",
    "description": "Rise Up has launched the Leadership & Advocacy Program to advance gender equity and justice in girls’ education. Funding Information Rise Up will competitively award grants of $17,000 USD to participating leaders and their organizations. Eligibility Criteria Eligible candidates must meet the following selection: Civil Society leaders of minimum 18 years of age at the time of the training in July 2025. Currently working in Nairobi, Kiambu, Kajiado or Machakos Counties. Has a personal interest and...",
    "amount": 19000,
    "currency": null,
    "status": "active",
    "eligibility": "Eligible candidates must meet the following selection: Civil Society leaders of minimum 18 years of age at the time of the training in July 2025. Currently working in Nairobi, Kiambu, Kajiado or Machakos Counties.",
    "category": "General"
  },
  {
    "deadline": "04-May-25",
    "title": "Request for Proposals: Slow Food Negroni Week Fund",
    "applicationUrl": "https://www.slowfood.com/it/insights/calls-for-proposals/",
    "organization": "Organization Not Found",
    "description": "Applications are now open for the Slow Food Negroni Week Fund. Hospitality professionals worldwide struggle with access to training and education that would take them to the next level in the beverage industry. They also lack opportunities to interact with producers for their professional and personal development , and to gain a deeper understanding of the origins of beverage. At the same time, hospitality professionals play a key role in conveying fundamental values, such as sustainability, soc...",
    "amount": 25000,
    "currency": null,
    "status": "active",
    "eligibility": "See official guidelines",
    "category": "General"
  },
  {
    "deadline": "11-Apr-25",
    "title": "Request for Proposals: Nature for Water (N4W) Program",
    "applicationUrl": "https://nature4water.org/offerings/call-proposals-window",
    "organization": "Organization Not Found",
    "description": "The Nature Conservancy and Pegasys are pleased to announce the Nature for Water (N4W) Program to drive watershed health through the large-scale deployment of Nature-based Solutions. This program provides comprehensive support, including program preparation, implementation assistance, and expertise in hydrology, GIS, ecology, governance, stakeholder engagement, finance, and project management. Winning applicants receive in-kind technical assistance from the N4W team to support program preparation...",
    "amount": null,
    "currency": null,
    "status": "active",
    "eligibility": "Before you begin your application, please revise the basic eligibility requirements. To qualify for pro-bono support, submissions must comply with the following basic conditions: Submissions must be made in English or Spanish.",
    "category": "General"
  },
  {
    "deadline": "07-Apr-25",
    "title": "Request for EOIs: IOC Young Leaders Programme",
    "applicationUrl": "https://www.olympics.com/ioc/news/request-for-expressions-of-interest-rfei-ioc-young-leaders-programme",
    "organization": "Organization Not Found",
    "description": "The International Olympic Committee is pleased to announce the IOC Young Leaders Programme to empower young talents to harness the power of sport to drive positive change in their communities. Since its inception, the programme has supported 145 IOC Young Leaders from 77 countries and territories, who have collectively delivered over 160 projects, positively impacting more than 55,000 individuals worldwide. This initiative directly contributes to Olympism365, the International Olympic Committee’...",
    "amount": 10,
    "currency": null,
    "status": "active",
    "eligibility": "See official guidelines",
    "category": "General"
  },
  {
    "deadline": "24-Apr-25",
    "title": "Catalytic Climate Finance Facility (CC Facility) Initiative 2025",
    "applicationUrl": "https://www.climatepolicyinitiative.org/press-release/cc-facility-launches-new-call-for-applications-targeting-sustainable-agriculture-and-climate-adaptation/",
    "organization": "Organization Not Found",
    "description": "The Catalytic Climate Finance Facility (CC Facility) has launched its fourth call for applications for high-impact, scalable, and market-ready blended climate finance solutions in developing economies. These solutions support a range of initiatives, such as climate-resilient agriculture, marine conservation, biodiversity, climate adaptation, and renewable energy. They do so via blended finance solutions, including debt, project finance platforms, and venture capital. The initiative is a partners...",
    "amount": 18000,
    "currency": null,
    "status": "active",
    "eligibility": "The CC Facility supports blended finance structures targeting climate action in developing economies. Applicants must meet the following criteria to be eligible for consideration: Investment theme: Structures addressing climate adaptation and/or mitigation.",
    "category": "General"
  },
  {
    "deadline": "01-Aug-25",
    "title": "Standards and Trade Development Facility’s Project Grant Program",
    "applicationUrl": "https://standardsfacility.org/project/apply",
    "organization": "Organization Not Found",
    "description": "The Standards and Trade Development Facility (STDF) Project Grant Program improves sanitary and phytosanitary (SPS) capacity in developing countries to facilitate safe trade. Funding Information Funds up to US$ 1,000,000 are available for PGs that improve food safety, animal and plant health capacity to comply with international sanitary and phytosanitary (SPS) requirements. The expected value of the in-kind contribution is as follows: Applicants from Least Developed Countries (LDCs) and Other L...",
    "amount": 1000000,
    "currency": "$",
    "status": "active",
    "eligibility": "The following organizations are eligible to apply for STDF funding: Public sector entities (including regional or international bodies) with responsibility for SPS measures or policy, either in their own right or in cooperation with the private sector.",
    "category": "General"
  },
  {
    "deadline": "08-Apr-25",
    "title": "Applications Open: Google Summer of Code Program",
    "applicationUrl": "https://opensource.googleblog.com/2025/03/google-summer-of-code-2025-contributor.html",
    "organization": "Organization Not Found",
    "description": "Join Google Summer of Code and contribute to the world of open source! Entries are now open for the Google Summer of Code Program. This is an exciting opportunity for students and beginners to open source (18+) to gain real-world experience this summer. You will spend 12+ weeks coding, learning about open source development , and earn a competitive stipend under the guidance of experienced mentors. Goals The GSoC program has several goals: Inspire developers to begin participating in open source...",
    "amount": null,
    "currency": null,
    "status": "active",
    "eligibility": "Organizations To participate in the Program, an Organization must: Run an active and viable open source software project; Have already produced and released software under an Open Source Initiative (OSI)-approved license; Not be based in a United States embargoed country, or otherwise prohibited by...",
    "category": "General"
  },
  {
    "deadline": "24-Apr-25",
    "title": "Nominations open for Arrell Global Food Innovation Award 2025",
    "applicationUrl": "https://arrellfoodinstitute.ca/awards/",
    "organization": "Organization Not Found",
    "description": "Nominations are now open for the Arrell Global Food Innovation Awards to recognize global excellence in the broad area of food innovation and community impact. Focus Areas In 2025, one award will be given: Community Impact: This award will recognize an individual, or group of individuals, who has contributed to improved nutritional health and/or food security , with a focus on strengthening disadvantaged communities. Themes Likely themes include: food sovereignty, food production, food distribut...",
    "amount": 25000,
    "currency": "$",
    "status": "active",
    "eligibility": "Citizens of any country are eligible for nomination, with no restrictions on gender, race, religion , creed or residency. Nominations may come from private companies, academic institutions, governmental units, charitable foundations, and not-for-profit organizations.",
    "category": "General"
  },
  {
    "deadline": "15-Jun-25",
    "title": "CFPs: GenScript Life Science Research Grant Program",
    "applicationUrl": "https://www.genscript.com/grantprogram.html",
    "organization": "Organization Not Found",
    "description": "The GenScript Life Science Research Grant Program is a new initiative dedicated to supporting breakthroughs in life science research areas. This program is designed to empower researchers by providing grant funding earmarked explicitly for purchasing GenScript reagents and services. Areas of Research The grant offers financial support to researchers engaged in projects that can contribute significantly to critical areas of life science research, including but not limited to: gene and cell therap...",
    "amount": null,
    "currency": null,
    "status": "active",
    "eligibility": "The program is open to researchers globally. There are no restrictions based on geographic location, and international applicants are encouraged to apply.",
    "category": "General"
  },
  {
    "deadline": "15-May-25",
    "title": "AI for Good launches Impact Awards Programme 2025",
    "applicationUrl": "https://aiforgood.itu.int/ai-for-good-impact-awards/",
    "organization": "Organization Not Found",
    "description": "AI for Good has launched the Impact Awards Programme to celebrate exceptional achievements in the field of AI, recognizing innovative, sustainable, and impactful AI solutions that contribute to global progress. Award Categories Discover the diverse categories honoring innovation and impact across various sectors. AI for People Recognizes AI-driven solutions that improve human well-being, advance education, promote equality, and enhance public health. From healthcare innovations and inclusive lea...",
    "amount": null,
    "currency": null,
    "status": "active",
    "eligibility": "Applications are open to individual contributors, SMEs, large corporations, non-profit organizations, academic and research institutions, and government bodies.",
    "category": "General"
  },
  {
    "deadline": "08-Apr-25",
    "title": "Youth Impact: Because You Matter – For Environmental Sustainability and Climate Action Initiative",
    "applicationUrl": "https://unesco.nestleyouthentrepreneurship.com/",
    "organization": "Organization Not Found",
    "description": "The Youth Impact: Because You Matter – For Environmental Sustainability and Climate Action is an initiative led by United Nations Educational, Scientific and Cultural Organization in collaboration with Nestlé to support young people to help their communities through climate action and environmental sustainability initiatives by providing them with resources and skills necessary to implement their innovative projects. Thematic Areas The applications submitted should propose innovative youth-led p...",
    "amount": 30000,
    "currency": null,
    "status": "active",
    "eligibility": "The Initiative’s primary and direct beneficiaries are young individuals, youth-led organizations, enterprises, associations, or networks who: Are identified as “youth” in their respective countries or, in lack of a national definition, within the age range of 18-30 years old from the beginning to th...",
    "category": "General"
  },
  {
    "deadline": "31-May-25",
    "title": "Entries now open for Sustainable Tourism Awards",
    "applicationUrl": "https://www.skal.org/sta-winners",
    "organization": "Organization Not Found",
    "description": "The Skål International Sustainable Tourism Awards recognize excellence in sustainability across the global tourism industry. Established in 2002 to promote responsible tourism, these awards highlight innovative and impactful initiatives that balance environmental, social, and economic sustainability. The awards serve as a prestigious platform to showcase best practices, inspire industrywide change, and reinforce the importance of sustainability in tourism development. Categories Accessible Touri...",
    "amount": null,
    "currency": null,
    "status": "active",
    "eligibility": "Open to public & private sector, NGOs, educational institutions, and government agencies related to Tourism worldwide. Accessible Tourism Category: Type of organization: Open to tourism-related businesses , non-profits, governmental bodies, and other organizations involved in promoting accessible to...",
    "category": "General"
  },
  {
    "deadline": "01-Sep-25",
    "title": "Call for Nominations: Stockholm Water Prize",
    "applicationUrl": "https://siwi.org/stockholm-water-prize/nominate?iproject=stockholm-water-prize",
    "organization": "Organization Not Found",
    "description": "The Stockholm International Water Institute is pleased to invite nominations for its Stockholm Water Prize to recognize people and organizations who have made outstanding contributions to the sustainable use and protection of the world’s water resources. The Stockholm Water Prize is awarded to an individual, institution or organisation that has made substantial scientific or other contribution to their understanding of water resources and the sustainable use and protection of them, thereby leadi...",
    "amount": null,
    "currency": null,
    "status": "active",
    "eligibility": "See official guidelines",
    "category": "General"
  },
  {
    "deadline": "04-Apr-25",
    "title": "Call for Participants: TrustLab Incubator Program (Kenya)",
    "applicationUrl": "https://akademie.dw.com/en/call-for-participants-trustlab-incubator-program-for-civil-society-organizations-in-kenya/a-71974144",
    "organization": "Organization Not Found",
    "description": "The Deutsche Welle Akademie is calling for civil society and community-based organizations in Mombasa and Lamu, Kenya, to apply for the second TrustLab Incubator on anti-discrimination and extremism. Funding Information The incubator program also offers you the opportunity to apply for a project grant of 5,000 EUR up to 15,000 EUR. Eligibility Criteria If you are a Kenyan CSO/CBO: with a human-rights-based approach, targeting vulnerable groups, especially women and/or the youth, with a strong co...",
    "amount": 15000,
    "currency": "EUR",
    "status": "active",
    "eligibility": "If you are a Kenyan CSO/CBO: with a human-rights-based approach, targeting vulnerable groups, especially women and/or the youth, with a strong connection to the communities you serve, facing digital threats (such as surveillance, intimidation, hate speech, disinformation, etc.",
    "category": "General"
  },
  {
    "deadline": "15-May-25",
    "title": "Call for Nominations: UIAA Mountain Protection Award",
    "applicationUrl": "https://www.theuiaa.org/mountain-protection-award/",
    "organization": "Organization Not Found",
    "description": "The International Climbing and Mountaineering Federation is thrilled to seek nominations for its Mountain Protection Award to promote and support projects that seek to protect mountain ecosystems and engage climbers and mountaineers in a direct and positive way. The Award platform also welcomes sustainable mountain tourism initiatives directly support and benefit the lives of mountain communities. Prize Information This year, two prizes are at stake: The Overall Winner: receiving EUR 8,000 prize...",
    "amount": 8000,
    "currency": "EUR",
    "status": "active",
    "eligibility": "Any project rooted in mountain sports with a focus on environmental sustainability and climate change is eligible to apply for the UIAA Mountain Protection Award.",
    "category": "General"
  },
  {
    "deadline": "30-Apr-25",
    "title": "Apply Now: Jeonju International Awards for Promoting Intangible Cultural Heritage",
    "applicationUrl": "https://jiapich.org/2023Jiapich/introduction/",
    "organization": "Organization Not Found",
    "description": "The Jeonju International Awards for Promoting Intangible Cultural Heritage aims to encourage the model safeguarding practices of ICH in the global community regardless of nationality, ethnicity, religion, race, age, gender, or any other political, social, economic or cultural orientation. Prize Information Total of 30,000 USD along with the JIAPICH Plaque, awarded to 1-5 individuals/organizations. Eligibility Criteria Individuals or organizations engaged in the protection and transmission of int...",
    "amount": 5000,
    "currency": null,
    "status": "active",
    "eligibility": "Individuals or organizations engaged in the protection and transmission of intangible cultural heritage are eligible to apply. Evaluation Criteria Contribution level to the protection and transmission of intangible cultural heritage Efforts to establish a governance system and strengthen social conn...",
    "category": "General"
  },
  {
    "deadline": "11-Apr-25",
    "title": "Call for Applications: COPPER CLM Research Grants",
    "applicationUrl": "https://itpcglobal.org/workwithus/research-grants/",
    "organization": "Organization Not Found",
    "description": "The “Mobilizing Expertise and Technical Assistance for CLM-PPR & Advocacy Leadership” (METAL) Consortium with International Treatment Preparedness Coalition (ITPC) as the lead has been contracted by the Global Fund to provide technical support in managing and overseeing the research grants. This research initiative aims to contribute to the development of scientific literature on the impact of Community-Led Monitoring (CLM) in HIV, TB and malaria health services, Pandemic Preparedness and Respon...",
    "amount": 45000,
    "currency": "$",
    "status": "active",
    "eligibility": "Applicants must: Be a community-led organization, research institution, or civil society organization with experience in CLM implementation, health advocacy, or research. CBO/CLO/CSO should lead/co-lead the research grants, in partnership with others.",
    "category": "General"
  },
  {
    "deadline": "14-May-25",
    "title": "Applications open for RSTMH Early Career Grants Programme",
    "applicationUrl": "https://afroscientric.com/2025/03/17/2025-rstmh-early-career-grants-applications/#:~:text=The%20RSTMH%20(Royal%20Society%20of,based%20anywhere%20in%20the%20world.",
    "organization": "Organization Not Found",
    "description": "The RSTMH (Royal Society of Tropical Medicine and Hygiene) Early Career Grants Programme provides awards for those who have not had equivalent research funding in their own name before. Purpose To enable early career researchers and global health professionals in the field of tropical medicine or global health to undertake clinical or scientific research and/or fieldwork, either as stand-alone projects or distinct elements within a larger project. Thematic Scope Applications can be on any area o...",
    "amount": 5000,
    "currency": "£",
    "status": "active",
    "eligibility": "Early Career Grants are for those who have not received a research grant in their own name before. They can be based in any country and can be working in any organisation.",
    "category": "General"
  },
  {
    "deadline": "12-May-25",
    "title": "UNESCO Prize for Girls’ and Women’s Education",
    "applicationUrl": "https://www.unesco.org/en/articles/unesco-prize-girls-and-womens-education-now-open-2025-nominations",
    "organization": "Organization Not Found",
    "description": "Are you driving transformative change for girls’ and women’s education? If yes, this is your chance to submit your initiative and become a laureate of the prestigious UNESCO Prize for Girls’ and Women’s Education. The United Nations Educational, Scientific and Cultural Organization has launched the call for nominations for the UNESCO Prize for Girls’ and Women’s Education. The Prize recognizes annually two laureates making outstanding efforts in favour of girls’ and women’s education. The Prize...",
    "amount": 50000,
    "currency": "$",
    "status": "active",
    "eligibility": "Nominations are made by governments of UNESCO Member States or non-governmental organizations (NGOs) in official partnership with UNESCO. They can nominate up to three individuals, institutions, or organizations making strong, innovative contributions to girls’ and women’s education.",
    "category": "General"
  },
  {
    "deadline": "15-Apr-25",
    "title": "Apply Now: Wellcome Mental Health Award",
    "applicationUrl": "http://wellcome.org/grant-funding/schemes/target-validation-mental-health?utm_source=linkedin&utm_medium=o-wellcome",
    "organization": "Organization Not Found",
    "description": "Wellcome is currenlty accepting applications for the Mental Health Award to provide funding for validation activities for novel targets with a clear therapeutic concept and strong biological rationale related to early intervention in anxiety, depression and/or psychosis. Funded proposals will generate data supporting the target’s therapeutic potential in the development of new and improved pharmacological treatments. Funding Information Funding amount: Up to £700,000 per project Funding duration...",
    "amount": 700000,
    "currency": "£",
    "status": "active",
    "eligibility": "See official guidelines",
    "category": "General"
  },
  {
    "deadline": "30-Apr-25",
    "title": "Call for Applications: Innovative WASH Solutions",
    "applicationUrl": "https://www.unicef.org/innovation/call-innovative-wash-solutions",
    "organization": "Organization Not Found",
    "description": "United Nations International Children’s Emergency Fund (UNICEF) Sustainable WASH Innovation Hub is looking for proven innovative WASH solutions with potential for accelerated scale. The UNICEF Sustainable WASH Innovation Hub sources, accelerates and scales transformative water, sanitation and hygiene (WASH) solutions to drive lasting impact for children and their families. Solutions within the innovation portfolios are selected based on their potential to accelerate results for children across m...",
    "amount": null,
    "currency": null,
    "status": "active",
    "eligibility": "Be a Registered Entity: Apply with one lead entity as a registered company, university spin-off, NGO, UN organization or Government agency. Have Financial Viability: Availability of a detailed financial plan and projections for the next 12 months.",
    "category": "General"
  },
  {
    "deadline": "09-Apr-25",
    "title": "RIGHT Foundation’s Product Development Award 2025",
    "applicationUrl": "https://rightfoundation.kr/en/funding-opportunities/",
    "organization": "Organization Not Found",
    "description": "The Product Development Award (PDA) general call seeks proposals aimed at developing new or improved vaccines, diagnostics, therapeutics, and biologics as global public goods for prevention and control of infectious diseases that disproportionately affect populations in low- and middle-income countries (LMICs). The RIGHT Foundation is a Korean non-profit organization supported by the Korean Ministry of Health and Welfare, Korean life science companies, and the Bill & Melinda Gates Foundation. RI...",
    "amount": 4,
    "currency": null,
    "status": "active",
    "eligibility": "Partnership requirement The applicant team must include at least one Korean entity with R&D expertise to make a significant contribution to the project. Inclusion of researchers, developers or advisors from the LMICs as the Principal Investigator or a collaborator is highly preferred.",
    "category": "General"
  },
  {
    "deadline": "30-Apr-25",
    "title": "The FairWays Foundation Grant Program 2025",
    "applicationUrl": "https://thefairwaysfoundation.com/apply/",
    "organization": "Organization Not Found",
    "description": "The FairWays Foundation Grant Program supports conservation-based projects where the belief and commitment demonstrated offer a meaningful contribution to long term change. The very heart of the foundation lies in the green industry and they are committed to further supporting both industry partners and their local communities, they believe that the push for change must continue to come from the grass roots level, these are the voices which speak loudest to The FairWays Foundation. Focus Areas T...",
    "amount": 25000,
    "currency": "$",
    "status": "active",
    "eligibility": "The FairWays Foundation supports Global Projects. Ultimately the aim is to proportionately allocate funds depending on level of revenue accumulated per geography, however the board have the right to direct funds into any meaningful application regardless of geography.",
    "category": "General"
  },
  {
    "deadline": "07-Apr-25",
    "title": "Submissions open for Creativity Pioneers Fund Program",
    "applicationUrl": "https://creativitypioneersfund.org/opencall",
    "organization": "Organization Not Found",
    "description": "The Creativity Pioneers Fund (CPF) catalyzes transformational social change by investing in, connecting, and championing cultural and creative organizations that advance bold and unconventional practices for building a more just, inclusive, and equitable world. Working with and alongside organizations, donors and other stakeholders across the creative ecosystem, the Creativity Pioneers Fund aims to mobilize a collective effort to advance Creativity for Social Change. The micro-grant represents o...",
    "amount": 27000,
    "currency": null,
    "status": "active",
    "eligibility": "Support is exclusively granted to legally registered, non-profit organizations that are actively operating, with no restrictions on geographic origin. Eligible organizations must: Place creativity at the core of their mission and programming, demonstrating its pivotal role in driving social transfor...",
    "category": "General"
  },
  {
    "deadline": "08-Jun-25",
    "title": "Spaces of Culture Funding Scheme in Sub-Saharan Africa",
    "applicationUrl": "https://www.eunicglobal.eu/news/spaces-of-culture-2025",
    "organization": "Organization Not Found",
    "description": "Are you a cultural and/or civil society organisation in Sub-Saharan Africa, looking to start or strengthen an Africa-Europe collaboration project in culture? Or, do you want to engage with other African and European partners to respond to local challenges through a co-creative and innovative cultural project? If yes, then The Spaces of Culture Funding Scheme is the right choice for you. The Spaces of Culture Funding Scheme is part of the EU-funded Africa-Europe Partnerships for Culture programme...",
    "amount": 50000,
    "currency": "EUR",
    "status": "active",
    "eligibility": "The call aims to broaden the range of local organisations collaborating with European counterparts in Sub-Saharan Africa. The call also supports the involvement of EUNIC members that wish to intensify their collaboration on the continent, particularly where the presence of EU Member States or a EUNI...",
    "category": "General"
  },
  {
    "deadline": "07-May-25",
    "title": "RPFs: Reducing Nitrification Risks Through Collaboration Between Drinking Water Wholesalers and Consecutive Systems",
    "applicationUrl": "https://www.waterrf.org/serve-file/RFP_5348.pdf",
    "organization": "Organization Not Found",
    "description": "The Water Research Foundation (WRF) has launched applications for the Reducing Nitrification Risks through Collaboration Between Drinking Water Wholesalers and Consecutive Systems project. Project Objectives The objective of this research project is to improve nitrification risk management in consecutive drinking water distribution systems. The specific objectives are: To catalog the roles and responsibilities of wholesale and consecutive systems—including regulatory requirements, water quality,...",
    "amount": 100000,
    "currency": "$",
    "status": "active",
    "eligibility": "Proposals will be accepted from domestic or international entities, including educational institutions, research organizations, governmental agencies, and consultants or other for-profit entities. For more information, visit WRF .",
    "category": "General"
  },
  {
    "deadline": "07-May-25",
    "title": "Call for Proposals: Per Capita Water Use Calculation",
    "applicationUrl": "https://www.waterrf.org/serve-file/RFP_5335.pdf",
    "organization": "Organization Not Found",
    "description": "The Water Research Foundation (WRF) is pleased to announce the applications for the Per Capita Water Use Calculation project. Project Objectives Understand how per capita water use is calculated and measured throughout North America and how it is used as a metric for comparison and water resource planning. Evaluate the risks and benefits associated with different methodologies for per capita water calculations and the risks and benefits of standardizing the calculation. Develop a framework, defi...",
    "amount": 18000,
    "currency": null,
    "status": "active",
    "eligibility": "Proposals will be accepted from both U.S.-based and non-U.S.-based entities, including educational institutions, research organizations, governmental agencies, and consultants or other for-profit entities. For more information, visit WRF .",
    "category": "General"
  },
  {
    "deadline": "07-May-25",
    "title": "Open Call: Integrating Equitable Outcomes into Water Reuse Projects",
    "applicationUrl": "https://www.waterrf.org/serve-file/RFP_5303.pdf",
    "organization": "Organization Not Found",
    "description": "The Water Research Foundation is accepting applications for the Integrating Equitable Outcomes into Water Reuse Projects. Project Objectives Equip utilities and decision-makers to holistically assess an alternative water system’s potential benefit and/or impact. Quantify or operationalize equitable impacts from alternative/diversifying water systems. Identify metrics to assess and inform decision-making processes for equitable implementation of diversifying water systems. Funding Information App...",
    "amount": 24000,
    "currency": null,
    "status": "active",
    "eligibility": "Proposals will be accepted from both U.S.-based and non-U.S.-based entities, including educational institutions, research organizations, governmental agencies, and consultants or other for-profit entities.",
    "category": "General"
  },
  {
    "deadline": "07-May-25",
    "title": "CFPs: Integrating Requirements, Drivers, and Technologies for Enhanced Distribution System Water Quality Monitoring",
    "applicationUrl": "https://www.waterrf.org/serve-file/RFP_5301.pdf",
    "organization": "Organization Not Found",
    "description": "The Water Research Foundation (WRF) invites proposals for Integrating Requirements, Drivers, and Technologies for Enhanced Distribution System Water Quality Monitoring project. Project Objectives Evaluate existing distribution system water quality monitoring programs designed for different purposes to identify opportunities for integration for future improvements in efficiency and effectiveness. Develop comprehensive guidance for designing, implementing, maintaining and using advanced and optimi...",
    "amount": 350000,
    "currency": "$",
    "status": "active",
    "eligibility": "Proposals will be accepted from both U.S.-based and non-U.S.-based entities, including educational institutions, research organizations, governmental agencies, and consultants or other for-profit entities.",
    "category": "General"
  },
  {
    "deadline": "07-May-25",
    "title": "RFPs: Smart and Connected Energy Management",
    "applicationUrl": "https://www.waterrf.org/serve-file/RFP_5296.pdf",
    "organization": "Organization Not Found",
    "description": "The Water Research Foundation (WRF) is seeking proposals for the Smart and Connected Energy Management project. Project Objectives Develop a comprehensive understanding of the current state of smart and connected energy management in water and wastewater utilities. Recommend tools and guidance for implementing smart water networks to reduce waste and improve overall energy efficiency. Funding Information Applicants may request up to $150,000 in WRF funds for this project. The anticipated period...",
    "amount": 150000,
    "currency": "$",
    "status": "active",
    "eligibility": "Proposals will be accepted from both U.S.-based and non-U.S.-based entities, including educational institutions, research organizations, governmental agencies, and consultants or other for-profit entities. For more information, visit WRF .",
    "category": "General"
  },
  {
    "deadline": "07-May-25",
    "title": "RFPs: Balancing Human and Natural Assets into a Holistic Water Resource Management Framework",
    "applicationUrl": "https://www.waterrf.org/serve-file/RFP_5295.pdf",
    "organization": "Organization Not Found",
    "description": "The Water Research Foundation (WRF) is requesting proposals to create a more effective watershed management framework by balancing human and natural land uses to overcome the limitations of past approaches focused on individual pollutants. The goal is to integrate human and natural systems to foster resilient watershed health, supported by a user-friendly decision-support framework and real-world case studies to guide stakeholders in improving holistic watershed management strategies: Review and...",
    "amount": 200000,
    "currency": "$",
    "status": "active",
    "eligibility": "Proposals will be accepted from both U.S.-based and non-U.S.-based entities, including educational institutions, research organizations, governmental agencies, and consultants or other for-profit entities.",
    "category": "General"
  },
  {
    "deadline": "15-Apr-25",
    "title": "Nominations open for Iris Prize 2025",
    "applicationUrl": "https://theirisproject.org/how-to-apply?fbclid=IwY2xjawI1BedleHRuA2FlbQIxMAABHRvIY-JplEFv9Fe5c6vpMdKCF0_6tnPG99NIOxdIA80s0BkctPdUHSnl9g_aem_Pj45ztlUxsDcxS7-Hv-XiQ",
    "organization": "Organization Not Found",
    "description": "Are you aged 14-24? Do you have an idea or an established project protecting or restoring nature in your local community? If yes, then apply now for the Iris Prize. Prize Categories To foster growth, creativity and sustainability in the youth environmental movement, they prioritise supporting projects at different stages of development : The Seed Prize (Ages 14-24) $5,000 Awarded to a young person or team with a groundbreaking idea to protect and/or restore nature in their local community. The S...",
    "amount": 24000,
    "currency": null,
    "status": "active",
    "eligibility": "You should only consider applying if: Your project or organisation is led by young people aged 14 to 24. To be eligible for an Iris Prize, most of your leadership must be young people with project autonomy and decision-making power. Please do not apply if you are not within this age category.",
    "category": "General"
  },
  {
    "deadline": "23-May-25",
    "title": "CFPs: Digitalisation for Flexible and Resilient Energy Systems Program (Phase II)",
    "applicationUrl": "https://3den.energy-base.org/",
    "organization": "Organization Not Found",
    "description": "The BASE Foundation has launched the call for pilot projects on Digitalisation for Flexible and Resilient Energy Systems targeting eight countries. This expansion aligns with Italy’s “Piano Mattei” and the “Rome Process”, which aim to deepen partnerships between Italy and Africa, focusing on sustainable development and energy transition. Funding Information Projects must have a budget between USD 500,000 and USD 2,000,000. Duration Projects must be implemented within a 24-month timeframe, includ...",
    "amount": 2000000,
    "currency": "USD",
    "status": "active",
    "eligibility": "UN agencies cannot submit applications to avoid conflicts of interest, as UNEP manages the selection and evaluation process. The consortium lead must not be from one of the eligible focus countries.",
    "category": "General"
  },
  {
    "deadline": "31-Jul-25",
    "title": "Applications open for Sigourney Award",
    "applicationUrl": "https://www.sigourneyaward.org/award-nomination-process",
    "organization": "Organization Not Found",
    "description": "The Sigourney Award welcomes applications to recognize the applicant pool includes extremely accomplished individuals and organizations, with contributions spanning decades. Award Information Award Recipients receive a substantial cash award. The award amount of the award varies each year based on a number of variables, including the annual number of recipients and tax requirements. Recipients may use their award in any manner they choose. Recognition Join a remarkable group of prize Recipients....",
    "amount": null,
    "currency": null,
    "status": "active",
    "eligibility": "See official guidelines",
    "category": "General"
  },
  {
    "deadline": "15-Aug-25",
    "title": "Open Call: John Templeton Foundation Grant Program",
    "applicationUrl": "https://www.templeton.org/grants/grant-faq",
    "organization": "Organization Not Found",
    "description": "The John Templeton Foundation is requesting applications for its grant program to support interdisciplinary research and catalyzes conversations that inspire awe and wonder. Funding Areas Individual Freedom & Free Markets The Individual Freedom & Free Markets Funding Area supports education, research , and outreach projects to promote individual freedom, free markets, free competition, and entrepreneurship. Grounded in the ideas of classical liberal political economy and with a commitment to the...",
    "amount": null,
    "currency": null,
    "status": "active",
    "eligibility": "They fund charitable entities that operate inside and outside of the United States . On rare occasions, they may fund individuals and for-profit companies doing charitable work that is consistent with the tax-exempt status. The Foundation has made grants to organizations from around the world.",
    "category": "General"
  },
  {
    "deadline": "18-Apr-25",
    "title": "Call for Entries: UNESCO-Japan Prize on Education for Sustainable Development",
    "applicationUrl": "https://www.unesco.org/en/prizes/education-sustainable-development",
    "organization": "Organization Not Found",
    "description": "The United Nations Educational, Scientific and Cultural Organization is pleased to invite nominations for its UNESCO-Japan Prize on Education for Sustainable Development. The Prize and award winners recognize the role of education in connecting the social, economic, cultural and environmental dimensions of sustainable development. Prize Information The Prize shall consist of three awards of US $50,000 for each of the three recipients, each of which is considered to merit a Prize. Eligibility Cri...",
    "amount": 50000,
    "currency": "$",
    "status": "active",
    "eligibility": "Candidates shall have made significant contributions to ESD, focusing on one or more of the five Priority Action Areas of the “ESD for 2030” framework: policy support whole-institution approaches educators youth local communities and contribute to the achievement of the SDGs through education.",
    "category": "General"
  },
  {
    "deadline": "09-May-25",
    "title": "ELF Healthy Lungs for Life Grants",
    "applicationUrl": "https://europeanlung.org/en/projects-and-campaigns/healthy-lungs-for-life/hold-your-own-event/apply-for-a-grant/",
    "organization": "Organization Not Found",
    "description": "The European Lung Foundation (ELF), in partnership with the Forum of International Respiratory Societies (FIRS), is excited to announce the Healthy Lungs for Life grants to organisations worldwide to support lung health awareness events. Aims Eligible activities should focus on one or more of the following aims: Air quality: Increase knowledge of the impact of poor air quality on lung health and actions to reduce air pollution exposure. Smoking cessation: Highlight the benefits of quitting smoki...",
    "amount": 1000,
    "currency": "€",
    "status": "active",
    "eligibility": "See official guidelines",
    "category": "General"
  },
  {
    "deadline": "26-May-25",
    "title": "Call for Solutions: Youth4Climate Funding Program to support Youth",
    "applicationUrl": "https://community.youth4climate.info/dashboard/call-solutions-2025",
    "organization": "Organization Not Found",
    "description": "Youth4Climate is accepting applications for its funding and learning opportunities, to fund new and existing youth-led solutions that are ready to implement or scale, and to support the further development of young people’s ideas and projects by providing relevant learning opportunities with the support of partners. There are 1.9 billion young people in the world, making up the largest generation in history. Young people are increasingly acknowledged as vital contributors to transformative clima...",
    "amount": 29000,
    "currency": null,
    "status": "active",
    "eligibility": "(see Call for Solutions guidelines) A legally registered, youth-led civil society organization (CSO), non-governmental organization (NGO), community-based organization (CBO), or company with the majority of the organization’s leadership being young people aged 18-29 years at the time of submitting t...",
    "category": "General"
  },
  {
    "deadline": "16-Apr-25",
    "title": "CFPs: Small Research Grants on Education Program",
    "applicationUrl": "https://www.spencer.org/grant_types/small-research-grant",
    "organization": "Organization Not Found",
    "description": "The Spencer Foundation is inviting proposals for its Small Research Grants on Education Program to support rigorous, intellectually ambitious and technically sound research that is relevant to the most pressing questions and compelling opportunities in education. The foundation seeks to support scholarship that develops new foundational knowledge that may have a lasting impact on educational discourse. This program supports proposals from multiple disciplinary and methodological perspectives, bo...",
    "amount": 50000,
    "currency": "$",
    "status": "active",
    "eligibility": "Proposals to the Small Research Grants on Education program must be for research projects that aim to study education. Principal Investigators (PIs) and Co-PIs applying for a Small Research Grant on Education must have an earned doctorate in an academic discipline or professional field.",
    "category": "General"
  },
  {
    "deadline": "09-May-25",
    "title": "Youth Voices Third-Party-Funding Mechanism Grant Program",
    "applicationUrl": "https://aueuyouthvoiceslab.eu/apply-now-the-youth-voices-third-party-funding-mechanism-for-youth-led-initiatives-is-here/",
    "organization": "Organization Not Found",
    "description": "The Youth Voices Third-Party-Funding Mechanism (TPFM) is a grant initiative under the AU-EU Youth Voices Lab – Power of the Collective to empower youth-led organizations to develop projects that amplify marginalized voices, drive advocacy, and strengthen youth networks. Through this funding, young changemakers can implement initiatives addressing societal challenges while ensuring youth voices influence national, regional, and continental decision-making, including the African Union (AU) and Eur...",
    "amount": 35000,
    "currency": null,
    "status": "active",
    "eligibility": "To be eligible, organizations must meet the following criteria: Youth-led: Decision-makers must be aged 15-35 years, with at least 70% of staff/volunteers under 35. Registered entity: Must be a youth-led NGO, association, trade union, collective, or alliance.",
    "category": "General"
  },
  {
    "deadline": "24-Apr-25",
    "title": "The Trinity Challenge: Community Access to Effective Antibiotics 2025",
    "applicationUrl": "https://solve.mit.edu/challenges/trinity-challenge-community-access-antibiotics",
    "organization": "Organization Not Found",
    "description": "Apply now for the Trinity Challenge: Community Access to Effective Antibiotics. Categories The Trinity Challenge on Community Access to Effective Antibiotics is particularly interested in the following two drivers: Lack of stock control at the sub-national/local level in community settings. Substandard and falsified oral antibiotics, which are estimated to make up 10% of antimicrobials used by humans in LMICs and 6.5% of veterinary medicines. Prize Information A prize fund of up to £1,000,000 wi...",
    "amount": 1000000,
    "currency": "£",
    "status": "active",
    "eligibility": "Applicants from all over the world are encouraged to apply. This Challenge particularly encourages solutions from teams based in low- and middle-income countries (LMICs) and multi-disciplinary teams. Previous Trinity Challenge applicants are able to apply.",
    "category": "General"
  },
  {
    "deadline": "27-Jun-25",
    "title": "Nominations open for Africa Food Prize 2025",
    "applicationUrl": "https://africafoodprize.org/",
    "organization": "Organization Not Found",
    "description": "Nominations are now open for the Africa Food Prize, a preeminent award recognizing an outstanding individual or institution that is leading the effort to change the reality of farming in Africa—from a struggle to survive to a business that thrives. Objectives The Africa Food Prize recognizes extraordinary women, men, and institutions whose outstanding contributions to African agriculture are forging a new era of sustainable food security and economic opportunity that elevates all Africans. Build...",
    "amount": 100000,
    "currency": "$",
    "status": "active",
    "eligibility": "See official guidelines",
    "category": "General"
  },
  {
    "deadline": "15-May-25",
    "title": "Wildlife Acoustics Scientific Product Grant Program 2025",
    "applicationUrl": "https://www.wildlifeacoustics.com/grant-program",
    "organization": "Organization Not Found",
    "description": "The Wildlife Acoustics is proud to offer a quarterly grant program that supports the advancement of wildlife research, habitat monitoring, and environmental conservation. Grant Types Standard Product Grant: Recorders & Software Software-Only Grant: Do you only need analysis software? They have streamlined the application process for the quarterly software grant. Selected recipients will receive one or more annual Kaleidoscope Pro licenses. NEW in 2025: Travel Grant – This grant is for early-care...",
    "amount": 12000,
    "currency": "$",
    "status": "active",
    "eligibility": "All sections of the application and any attachments must be written in English. You must include one letter of recommendation. (Please note: this is not required for Software-Only Grant applications.",
    "category": "General"
  },
  {
    "deadline": "11-Aug-25",
    "title": "Apply for American Express Leadership Academy",
    "applicationUrl": "https://commonpurpose.org/american-express-leadership-academy#anchor1",
    "organization": "Organization Not Found",
    "description": "Are you ready to drive change forward in your organization and help grow the foundations needed for the future success of the non-profit sector? Apply for the American Express Leadership Academy to strengthen the non-profit sector by building the capacity of its leaders. Are you ready to drive change forward in your organization and help grow the foundations needed for the future success of the non-profit sector? Apply for the American Express Leadership Academy to strengthen the non-profit sect...",
    "amount": null,
    "currency": null,
    "status": "active",
    "eligibility": "Senior leaders, currently in or identified for executive roles in future Works for a registered non-profit In roles that require them to accelerate their ability to influence inside and outside their organizations With a track record of innovation, embraces change, and want to transform their team,...",
    "category": "General"
  },
  {
    "deadline": "30-Apr-25",
    "title": "Request for Applications: Climate Impacts Awards",
    "applicationUrl": "https://wellcome.org/grant-funding/schemes/climate-impacts",
    "organization": "Organization Not Found",
    "description": "Wellcome is pleased to announce the Climate Impacts Awards to make the impacts of climate change on physical and mental health visible to drive urgent climate policy action at scale. They will fund transdisciplinary teams to deliver short-term, high-impact projects that maximise policy outcomes by combining evidence generation with influencing and engagement strategies. Funding Information Funding amount: Up to £2.5 million Funding duration: Up to 3 years Who can apply? The team must: Be transdi...",
    "amount": 2,
    "currency": "£",
    "status": "active",
    "eligibility": "See official guidelines",
    "category": "General"
  },
  {
    "deadline": "05-May-25",
    "title": "Spatial Thinking: Inspiring Action through Place- Based Solutions Grant Program",
    "applicationUrl": "https://www.nationalgeographic.org/society/grants-and-investments/rfp-spatial-thinking-inspiring-action-through-place-based-solutions/",
    "organization": "Organization Not Found",
    "description": "The National Geographic Society is accepting applications for Level I and Level II grants for the Spatial Thinking: Inspiring Action with Place-Based Solutions. This funding opportunity supports projects that identify a challenge related to a specific place and its unique conditions and leverages an educational solution using spatial thinking to enable people to act on behalf of the planet and its people. Spatial thinking is a powerful tool for understanding and telling stories of the past and p...",
    "amount": 100000,
    "currency": "$",
    "status": "active",
    "eligibility": "Applicants must be 18 or older at the time they submit their application. Project start dates should be a minimum of six months after the submission deadline to ensure any awarded funds are received in time.",
    "category": "General"
  },
  {
    "deadline": "07-Sep-25",
    "title": "Call to Entries: Ebbe Nielsen Challenge 2025",
    "applicationUrl": "https://www.gbif.org/news/7cNvqaLzeSyQrLOulk4L5S/2025-ebbe-nielsen-challenge-seeks-innovations-for-open-biodiversity-data",
    "organization": "Organization Not Found",
    "description": "Applications are now open for the Ebbe Nielsen Challenge focused on innovative tools, both new and existing, that leverage biodiversity data from the Global Biodiversity Information Facility (GBIF) network to advance open science in support of research and policy. Prize Information An expert jury will judge entries on their relevance, novelty and quality to select a pool of winners to share a prize pool of up to €20,000. Eligibility Criteria The Challenge is open to: Individuals Teams of individ...",
    "amount": 20000,
    "currency": "€",
    "status": "active",
    "eligibility": "The Challenge is open to: Individuals Teams of individuals, with no limit on the number of people included in a team Organizations—including corporations, not-for-profit corporations and other nonprofit organizations, limited liability companies, partnerships, and other legal entities)—at exist and...",
    "category": "General"
  },
  {
    "deadline": "30-Apr-25",
    "title": "Call for Nominations: UNESCO – Greece Melina Mercouri International Prize for the Safeguarding and Management of Cultural Landscapes",
    "applicationUrl": "https://whc.unesco.org/en/culturallandscapesprize/",
    "organization": "Organization Not Found",
    "description": "The United Nations Educational, Scientific and Cultural Organization is inviting nominations for its Greece Melina Mercouri International Prize for the Safeguarding and Management of Cultural Landscapes to reward outstanding examples of action to safeguard and enhance the world’s cultural landscapes. Prize Information The US$30,000 Prize is awarded every two years to one laureate. Eligibility Criteria Individuals, institutions, other entities, communities or non-governmental organizations (in of...",
    "amount": 30000,
    "currency": "$",
    "status": "active",
    "eligibility": "Individuals, institutions, other entities, communities or non-governmental organizations (in official partnerships with UNESCO or not) that have made a significant contribution to the safeguarding, management and enhancement of the world’s major cultural landscapes.",
    "category": "General"
  },
  {
    "deadline": "29-Apr-25",
    "title": "Nominations open for Einstein Award for Promoting Quality in Research",
    "applicationUrl": "https://award.einsteinfoundation.de/",
    "organization": "Organization Not Found",
    "description": "The Einstein Award for Promoting Quality in Research in cooperation with the QUEST Center for Responsible Research at the Berlin Institute of Health at Charité honors researchers, institutions, and early career researchers around the globe whose work helps to fundamentally advance the quality, transparency, and reproducibility of science and research. The award aims to provide recognition and publicity for outstanding efforts that enhance the rigor, reliability, robustness, and transparency of r...",
    "amount": 350000,
    "currency": "€",
    "status": "active",
    "eligibility": "Researchers and institutions worldwide that are engaged in science, research, education, and scholarship are encouraged to participate in this award. It acknowledges outstanding contributions to advancing the rigor, reliability, and transparency of research.",
    "category": "General"
  },
  {
    "deadline": "23-Jun-25",
    "title": "Call for Applications: Zayed Sustainability Prize",
    "applicationUrl": "https://entry.zayedsustainabilityprize.com/ZSPHome",
    "organization": "Organization Not Found",
    "description": "Applications are now open for the Zayed Sustainability Prize that recognises and rewards small to medium-sized enterprises (SMEs), nonprofit organisations (NPOs), and global high schools with impactful, innovative and inspiring sustainable solutions. Established by the UAE leadership in 2008, the Prize honours the humanitarian and sustainability legacy of the UAE’s founding father, the late Sheikh Zayed bin Sultan Al Nahyan. Over the past 16 years, the Zayed Sustainability Prize has awarded 117...",
    "amount": 5900000,
    "currency": "$",
    "status": "active",
    "eligibility": "Organisations must be a small or medium sized enterprise (SME) or a non-profit organisation (NPO). Organisations must also demonstrate a clear vision and long-term plan to further deploy their solution and scale up their impact, as well as inspiring others to follow suit by advancing sustainable and...",
    "category": "General"
  },
  {
    "deadline": "14-Apr-25",
    "title": "Entries open for ICIP Peace in Progress Award",
    "applicationUrl": "https://www.icip.cat/en/call-for-nominations-for-the-icip-peace-in-progress-award-2025/",
    "organization": "Organization Not Found",
    "description": "The International Catalan Institute for Peace is thrilled to invite applications for its Peace in Progress Award to reward and publicly recognize individuals, organizations or institutions that have made a significant contribution toward promoting and fostering peace. Prize Information The ICIP Peace in Progress Award consists of an honorary distinction, public recognition, a sculpture, and a €6,000 reward. Eligibility Criteria Eligible for this award are natural and non-profit legal persons fro...",
    "amount": 6000,
    "currency": "€",
    "status": "active",
    "eligibility": "Eligible for this award are natural and non-profit legal persons from around the world that have made an outstanding contribution to the construction and promotion of peace in Catalonia or in any other country. No award will be granted posthumously.",
    "category": "General"
  },
  {
    "deadline": "09-Apr-25",
    "title": "Nominations open for Nature Awards to inspire Women in Science",
    "applicationUrl": "https://www.nature.com/immersive/inspiringwomeninscience/index.html",
    "organization": "Organization Not Found",
    "description": "Are you committed to advancing gender equality in STEM? Are you dedicated to encouraging girls and young women to engage with STEM subjects and pursue careers in science? If yes, then this opportunity is right for you. The Springer Nature Limited is looking to celebrate and support the achievements of women in science and those who inspire the next generation of female scientists around the world. Categories They invite applications in two award categories: Science Outreach and Scientific Achiev...",
    "amount": 50000,
    "currency": "$",
    "status": "active",
    "eligibility": "Science Outreach category They are looking for initiatives that have either: encouraged girls or young women to engage with and study natural sciences, technology, engineering, mathematics, and medicine (STEM) or increased retention of women in STEM careers, with a focus on providing tools to suppor...",
    "category": "General"
  },
  {
    "deadline": "16-Apr-25",
    "title": "CFPs: Informing Humanitarian response through Research, Learning and Innovation",
    "applicationUrl": "https://novonordiskfonden.dk/en/grant/informing-humanitarian-response-through-research-learning-and-innovation/",
    "organization": "Organization Not Found",
    "description": "The Novo Nordisk Foundation is seeking submissions for its grant program to support humanitarian actors and the humanitarian system in identifying, adapting, or integrating research, learning, and innovative approaches to improve the quality of humanitarian response and deliver better outcomes for people affected by humanitarian crises. Areas of Support With this call, the Novo Nordisk Foundation is looking for applications focusing on research and learning, and/or innovative approaches in human...",
    "amount": 2,
    "currency": null,
    "status": "active",
    "eligibility": "Proposed projects must directly relate to the provision of humanitarian assistance in emergencies, disaster prevention and preparedness, or recovery. It may also pertain to the provision of assistance to people affected by protracted and complex crises.",
    "category": "General"
  },
  {
    "deadline": "07-Apr-25",
    "title": "Open Call: Echo360 e3 Tech Grant Program",
    "applicationUrl": "https://echo360.com/company/grants/",
    "organization": "Organization Not Found",
    "description": "Submissions are now open for the Echo360 e3 Tech Grant Program that provide educators and trainers resources to advance equity, engagement, and evidence in every learning environment. Grant Types There are two types of grant opportunities available for qualified applicants: EchoImpact Grant EchoImpact Grants may be up to $2,000 USD in research funding for instructors or trainers currently using one or more Echosystem solutions at their institution or organization. EchoImpacts Grants support rese...",
    "amount": 2000,
    "currency": "$",
    "status": "active",
    "eligibility": "Eligible applications are from educational institutions and legitimate organizations with training demands. Evaluation Criteria Grant awards will be determined by how thoroughly an applicant’s research or implementation plan considers all three of the following impact areas in their learning environ...",
    "category": "General"
  },
  {
    "deadline": "07-Apr-25",
    "title": "Call for Nominations: UNHCR Nansen Refugee Award",
    "applicationUrl": "https://www.unhcr.org/about-unhcr/overview/nansen-refugee-award/nominate",
    "organization": "Organization Not Found",
    "description": "The United Nations High Commissioner for Refugees (UNHCR) has announced the Nansen Refugee Award to recognize several individuals, groups or organizations that have taken extraordinary action to protect and assist refugees, internally displaced or stateless people. Prize Information US$100,000 for the global laureate, US$25,000 for regional winners. Eligibility Criteria Any individual, group of people or organization that has done extraordinary humanitarian work on behalf of refugees, internally...",
    "amount": 100000,
    "currency": "$",
    "status": "active",
    "eligibility": "Any individual, group of people or organization that has done extraordinary humanitarian work on behalf of refugees, internally displaced or stateless people is eligible – with the exception of former and current UNHCR staff, including United Nations Volunteers (UNVs) working for UNHCR offices.",
    "category": "General"
  },
  {
    "deadline": "01-May-25",
    "title": "CFAs: Merdeka Award for Individuals and Organisations",
    "applicationUrl": "https://www.merdekaaward.my/the-award",
    "organization": "Organization Not Found",
    "description": "The Merdeka Award recognises and rewards excellent individuals and organisations, serving as a beacon for those who have not only contributed to the nation’s growth but have also inspired greatness in the people of Malaysia. Objective The Merdeka Award commemorates the true spirit of independence which transcends the conventional definition of national sovereignty. It explores the liberation of the mind and spirit – factors which foster the realisation of human potential and the pursuit of excel...",
    "amount": null,
    "currency": null,
    "status": "active",
    "eligibility": "To be considered as a candidate, there are certain eligibility considerations to be fulfilled: All Award categories, except for Anugerah Khas Merdeka Award category, are open solely to the citizens of Malaysia, whether residing in Malaysia or abroad, and any Malaysian institution or organisation.",
    "category": "General"
  },
  {
    "deadline": "30-Apr-25",
    "title": "Small Conservation Grants Program in Sub Saharan Africa",
    "applicationUrl": "http://janatrustfund.org/index_en.html",
    "organization": "Organization Not Found",
    "description": "The Jana Robeyst Trust Fund (JRTF) is pleased to announce the Small Conservation Grants Program to provide financial resources to early career biologists/conservationists to carry out vital field conservation and research work in Africa. This means the financial support of the study and protection of endangered mammals and more specifically the elephants. Funding Information Small grants will be awarded up to a maximum of 1,500 euro. Eligible Projects Eligible project will have a clear conservat...",
    "amount": 1500,
    "currency": "eur",
    "status": "active",
    "eligibility": "The JRTF aims to provide relatively small levels of funding for ongoing projects or pilot programmes with a clear conservation value. This funding program is open to early career biologists for projects in Sub-Saharan Africa.",
    "category": "General"
  }
]